---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalDefineThermalPropertiesBy
source: html/c2080563-1e47-3fc2-f4b2-e018f8747290.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalDefineThermalPropertiesBy Property

"Define Thermal Properties by"

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalDefineThermalPropertiesBy { get; }
```